<a href="https://colab.research.google.com/github/Kamilo1133/data-science-bootcamp/blob/main/01_pandas_intro_series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [25]:
import pandas as pd
import numpy as np

In [4]:
price = pd.Series(data={'Apple': 200, 'CD Projekt': 60, 'Amazon': 1900})
price

Apple          200
CD Projekt      60
Amazon        1900
dtype: int64

In [5]:
price['CD Projekt']

np.int64(60)

In [6]:
price[1]

<ipython-input-6-36dbb2ffbeb5>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  price[1]

np.int64(60)

In [7]:
price.count

<bound method Series.count of Apple          200
CD Projekt      60
Amazon        1900
dtype: int64>

In [11]:
print(price.count())

3

In [12]:
price.value_counts()

200     1
60      1
1900    1
Name: count, dtype: int64

In [13]:
print(price)

Apple          200
CD Projekt      60
Amazon        1900
dtype: int64

In [14]:
price.sum()

np.int64(2160)

In [15]:
price.std()

1024.3046421841502

In [16]:
price.describe()

count       3.000000
mean      720.000000
std      1024.304642
min        60.000000
25%       130.000000
50%       200.000000
75%      1050.000000
max      1900.000000
dtype: float64

In [22]:
price = pd.Series(data={'Apple': 200, 'CD Projekt': 60, 'Amazon': 1900, 'KGHM': np.nan})
print(price)

Apple          200.0
CD Projekt      60.0
Amazon        1900.0
KGHM             NaN
dtype: float64

In [26]:
price.count()

np.int64(3)

In [28]:
price.value_counts(dropna=False)

200.0     1
60.0      1
1900.0    1
NaN       1
Name: count, dtype: int64

In [29]:
price.min()

60.0

In [30]:
price.describe()

count       3.000000
mean      720.000000
std      1024.304642
min        60.000000
25%       130.000000
50%       200.000000
75%      1050.000000
max      1900.000000
dtype: float64

In [32]:
price.nlargest(2)

Amazon    1900.0
Apple      200.0
dtype: float64

In [35]:
price.nsmallest(2)

CD Projekt     60.0
Apple         200.0
dtype: float64

In [36]:
price.rank()

Apple         2.0
CD Projekt    1.0
Amazon        3.0
KGHM          NaN
dtype: float64

In [37]:
price.sort_values()

CD Projekt      60.0
Apple          200.0
Amazon        1900.0
KGHM             NaN
dtype: float64

In [38]:
price.sort_values(ascending=False)

Amazon        1900.0
Apple          200.0
CD Projekt      60.0
KGHM             NaN
dtype: float64

In [39]:
price.apply(lambda x: x * 3.8)

Apple          760.0
CD Projekt     228.0
Amazon        7220.0
KGHM             NaN
dtype: float64

In [40]:
price

Apple          200.0
CD Projekt      60.0
Amazon        1900.0
KGHM             NaN
dtype: float64

In [41]:
price_pln = price.apply(lambda x: x * 3.8)

In [42]:
price_pln

Apple          760.0
CD Projekt     228.0
Amazon        7220.0
KGHM             NaN
dtype: float64

In [43]:
price

Apple          200.0
CD Projekt      60.0
Amazon        1900.0
KGHM             NaN
dtype: float64